Revit 2027 API
ColorFillScheme.Duplicate Method
 Generates a copy of current scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Duplicate(
	string name
)
Public Function Duplicate (
	name As String
) As ElementId
public:
ElementId^ Duplicate(
	String^ name
)
member Duplicate :
        name : string -> ElementId
Parameters
name String
 The desired name of copied scheme.
Return Value
ElementId
 The id of copied scheme.
Exceptions
Exception | Condition
ArgumentException |  The name is not valid for new generated scheme.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace